[
  {
    "id": 1,
    "title": "Pulp Fiction",
    "genres": [
      "Action",
      "Adventure",
      "Crime"
    ],
    "description": "Pulp Fiction is a 1994 American neo-noir black comedy crime drama film written and directed by Quentin Tarantino, who conceived it with Roger Avary. Starring John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman, it tells several stories of criminal Los Angeles.",
    "poster": "/images/pulp_fiction.jpg",
    "release": "1991-02-07",
    "runtime": 151,
    "rating": 4.2
  },
  {
    "id": 2,
    "title": "Bohemian Rhapsody",
    "genres": [
      "Drama",
      "Biography",
      "Romance",
      "Documentary"
    ],
    "description": "Bohemian Rhapsody is a foot-stomping celebration of Queen, their music and their extraordinary lead singer Freddie Mercury. ... Bohemian Rhapsody is a movie based on the true story of Queen's journey from the start of the rock band to their now-legendary 1985 performance at the Live Aid concert in Wembley Stadium.",
    "poster": "/images/rapsody.jpg",
    "release": "1992-02-07",
    "runtime": 152,
    "rating": 2.2
  },
  {
    "id": 3,
    "title": "Kill Bill: Vol2",
    "genres": [
      "Drama",
      "Romance",
      "Crime"
    ],
    "description": "Quentin Tarantino's \"Kill Bill, Volume 2\" is an exuberant celebration of moviemaking, coasting with heedless joy from one audacious chapter to another, working as irony, working as satire, working as drama, working as pure action.",
    "poster": "/images/kill_bill_2.jpg",
    "release": "1993-02-07",
    "runtime": 153,
    "rating": 5.1
  },
  {
    "id": 4,
    "title": "Avengers: War of Infinity",
    "genres": [
      "Action",
      "Adventure"
    ],
    "description": "Summaries. The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe. ... The mad titan Thanos (Josh Brolin) begins his hunt for the most powerful objects in the universe, the Infinity Stones, in this movie ...",
    "poster": "/images/avengers_infi_war.jpg",
    "release": "1994-02-07",
    "runtime": 154,
    "rating": 4.8
  },
  {
    "id": 5,
    "title": "Intercaption",
    "genres": [
      "Action",
      "Adventure"
    ],
    "description": "Inception is a 2010 science fiction action film[4][5][6] written and directed by Christopher Nolan, who also produced the film with his wife, Emma Thomas. The film stars Leonardo DiCaprio as a professional thief who steals information by infiltrating the subconscious of his targets. He is offered a chance to have his criminal history erased as payment for the implantation of another person's idea into a target's subconscious.[7] The ensemble cast includes Ken Watanabe, Joseph Gordon-Levitt, Marion Cotillard, Ellen Page, Tom Hardy, Dileep Rao, Cillian Murphy, Tom Berenger, and Michael Caine.",
    "poster": "/images/inception.jpg",
    "release": "1994-02-07",
    "runtime": 155,
    "rating": 3.8
  },
  {
    "id": 6,
    "title": "Reservoir Dogs",
    "genres": [
      "Drama",
      "Crime"
    ],
    "description": "The film is regarded as a classic of independent film and a cult film,[4] and was named \"Greatest Independent Film of all Time\" by Empire. Although controversial for its depictions of violence and use of profanity, Reservoir Dogs was generally well received, with the cast being praised by many critics. Despite not being heavily promoted during its theatrical run, the film became a modest success in the United States after grossing $2.8 million against its scant budget. It achieved higher popularity after the success of Tarantino's next film, Pulp Fiction (1994). A soundtrack was released featuring songs used in the film, which are mostly from the 1970s.",
    "poster": "/images/reservoirs_dogs.jpg",
    "release": "1996-02-07",
    "runtime": 156,
    "rating": 2.7
  },
  {
    "id": 7,
    "title": "Unknown movie",
    "genres": [
      "DEFAULT"
    ],
    "description": "Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie. Unknown movie.",
    "poster": "",
    "release": "2020-01-01",
    "runtime": 170,
    "rating": 3.2
  }
]
